<h1>Final Project Milestone 3</h1>

Information pulled from - https://en.wikipedia.org/wiki/Template:COVID-19_pandemic_data
<br><i>* Webpage information source changed from week 1 due to workabilty issues related to embedded table</i>

In [1]:
#libraries
import pandas as pd 
import requests 
from bs4 import BeautifulSoup
import numpy as np

<h3>1. Scrape webpage and place into a Data Frame as a readable format

In [2]:
# get the response in the form of html
wikiurl="https://en.wikipedia.org/wiki/Template:COVID-19_pandemic_data"
table_class="wikitable sortable jquery-tablesorter"
response=requests.get(wikiurl)

#print response code to check if we are ok to scrape
print(response.status_code)

200

In [3]:
# parse data from the html into a beautifulsoup object
soup = BeautifulSoup(response.text, 'html.parser')
covidtable=soup.find('table',{'class':"wikitable"})

In [4]:
df=pd.read_html(str(covidtable))

# convert list to dataframe
df=pd.DataFrame(df[0])
print(df.head())

  Location         Location.1      Cases   Deaths Unnamed: 4 Unnamed: 5  \
0      NaN           World[a]  242987401  4938251        NaN        NaN
1      NaN      United States   45400466   735373        NaN        NaN
2      NaN  European Union[b]   39371457   788718        NaN        NaN
3      NaN              India   34159562   453708        NaN        NaN
4      NaN             Brazil   21711843   605139        NaN        NaN

  Unnamed: 6 Unnamed: 7
0        NaN        NaN
1        NaN        NaN
2        NaN        NaN
3        NaN        NaN
4        NaN        NaN

<h3>2. Create a subset of data for columns with values</h3>

In [5]:
df = df[["Location.1","Cases","Deaths"]]

In [6]:
df

,Location.1,Cases,Deaths
0,World[a],242987401,4938251
1,United States,45400466,735373
2,European Union[b],39371457,788718
3,India,34159562,453708
4,Brazil,21711843,605139
...,...,...,...
191,Marshall Islands,4,—
192,Samoa,3,—
193,Kiribati,2,—
194,Federated States of Micronesia,1,0
195,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...

<h3>3. Rename column with more appropriate name</h3>

In [7]:
df = df.rename(columns = {"Location.1":"country"})

In [8]:
df

,country,Cases,Deaths
0,World[a],242987401,4938251
1,United States,45400466,735373
2,European Union[b],39371457,788718
3,India,34159562,453708
4,Brazil,21711843,605139
...,...,...,...
191,Marshall Islands,4,—
192,Samoa,3,—
193,Kiribati,2,—
194,Federated States of Micronesia,1,0
195,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...

<h3>4. Check values for malformed or invalid values in country</h3>

In [9]:
np.unique(df['country'])

array([".mw-parser-output .reflist{font-size:90%;margin-bottom:0.5em;list-style-type:decimal}.mw-parser-output .reflist .references{font-size:100%;margin-bottom:0;list-style-type:inherit}.mw-parser-output .reflist-columns-2{column-width:30em}.mw-parser-output .reflist-columns-3{column-width:25em}.mw-parser-output .reflist-columns{margin-top:0.3em}.mw-parser-output .reflist-columns ol{margin-top:0}.mw-parser-output .reflist-columns li{page-break-inside:avoid;break-inside:avoid-column}.mw-parser-output .reflist-upper-alpha{list-style-type:upper-alpha}.mw-parser-output .reflist-upper-roman{list-style-type:upper-roman}.mw-parser-output .reflist-lower-alpha{list-style-type:lower-alpha}.mw-parser-output .reflist-lower-greek{list-style-type:lower-greek}.mw-parser-output .reflist-lower-roman{list-style-type:lower-roman} ^ Countries which do not report data for a column are not included in that column's world total. ^ Data on member states of the European Union are individually listed, but are also summed here for convenience. They are not double-counted in world totals. ^ Does not include special administrative regions (Hong Kong and Macau) or Taiwan.",
       'Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua and Barbuda', 'Argentina', 'Armenia', 'Australia',
       'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh',
       'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan',
       'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Brunei', 'Bulgaria', 'Burkina Faso', 'Burundi', 'Cabo Verde',
       'Cambodia', 'Cameroon', 'Canada', 'Central African Republic',
       'Chad', 'Chile', 'China[c]', 'Colombia', 'Comoros', 'Costa Rica',
       'Croatia', 'Cuba', 'Cyprus', 'Czechia',
       'Democratic Republic of the Congo', 'Denmark', 'Djibouti',
       'Dominica', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia',
       'Eswatini', 'Ethiopia', 'European Union[b]',
       'Federated States of Micronesia', 'Fiji', 'Finland', 'France',
       'Gabon', 'Gambia', 'Georgia', 'Germany', 'Ghana', 'Greece',
       'Grenada', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Guyana',
       'Haiti', 'Honduras', 'Hong Kong', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Israel', 'Italy', 'Ivory Coast',
       'Jamaica', 'Japan', 'Jordan', 'Kazakhstan', 'Kenya', 'Kiribati',
       'Kosovo', 'Kuwait', 'Kyrgyzstan', 'Laos', 'Latvia', 'Lebanon',
       'Lesotho', 'Liberia', 'Libya', 'Liechtenstein', 'Lithuania',
       'Luxembourg', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives',
       'Mali', 'Malta', 'Marshall Islands', 'Mauritania', 'Mauritius',
       'Mexico', 'Moldova', 'Monaco', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'North Macedonia',
       'Norway', 'Oman', 'Pakistan', 'Palau', 'Palestine', 'Panama',
       'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Qatar', 'Republic of Ireland',
       'Republic of the Congo', 'Romania', 'Russia', 'Rwanda',
       'Saint Kitts and Nevis', 'Saint Lucia',
       'Saint Vincent and the Grenadines', 'Samoa', 'San Marino',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia', 'Slovenia',
       'Solomon Islands', 'Somalia', 'South Africa', 'South Korea',
       'South Sudan', 'Spain', 'Sri Lanka', 'Sudan', 'Suriname', 'Sweden',
       'Switzerland', 'Syria', 'Taiwan', 'Tajikistan', 'Tanzania',
       'Thailand', 'Timor-Leste', 'Togo', 'Trinidad and Tobago',
       'Tunisia', 'Turkey', 'Uganda', 'Ukraine', 'United Arab Emirates',
       'United Kingdom', 'United States', 'Uruguay', 'Uzbekistan',
       'Vanuatu', 'Vatican City', 'Venezuela', 'Vietnam', 'World[a]',
       'Yemen', 'Zambia', 'Zimbabwe'], dtype=object)

One malformed column is present, however, it also contains some helpful information in regards to aggregate numbers.  The malformed value will be dropped, but the information will be retained for reference.
<br>
<i>^ Countries which do not report data for a column are not included in that column's world total. ^ Data on member states of the European Union are individually listed, but are also summed here for convenience. They are not double-counted in world totals. ^ Does not include special administrative regions (Hong Kong and Macau) or Taiwan.</i>

<h3>5. Create sub-set for countries and region aggregate totals, while not using the malformed value</h3>

In [10]:
df_country = df.iloc[3:194]
df_region = df.iloc[["0","1","2"]]

In [11]:
np.unique(df_country['country'])

array(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua and Barbuda', 'Argentina', 'Armenia', 'Australia',
       'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh',
       'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan',
       'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Brunei', 'Bulgaria', 'Burkina Faso', 'Burundi', 'Cabo Verde',
       'Cambodia', 'Cameroon', 'Canada', 'Central African Republic',
       'Chad', 'Chile', 'China[c]', 'Colombia', 'Comoros', 'Costa Rica',
       'Croatia', 'Cuba', 'Cyprus', 'Czechia',
       'Democratic Republic of the Congo', 'Denmark', 'Djibouti',
       'Dominica', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia',
       'Eswatini', 'Ethiopia', 'Fiji', 'Finland', 'France', 'Gabon',
       'Gambia', 'Georgia', 'Germany', 'Ghana', 'Greece', 'Grenada',
       'Guatemala', 'Guinea', 'Guinea-Bissau', 'Guyana', 'Haiti',
       'Honduras', 'Hong Kong', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Israel', 'Italy', 'Ivory Coast',
       'Jamaica', 'Japan', 'Jordan', 'Kazakhstan', 'Kenya', 'Kiribati',
       'Kosovo', 'Kuwait', 'Kyrgyzstan', 'Laos', 'Latvia', 'Lebanon',
       'Lesotho', 'Liberia', 'Libya', 'Liechtenstein', 'Lithuania',
       'Luxembourg', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives',
       'Mali', 'Malta', 'Marshall Islands', 'Mauritania', 'Mauritius',
       'Mexico', 'Moldova', 'Monaco', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'North Macedonia',
       'Norway', 'Oman', 'Pakistan', 'Palau', 'Palestine', 'Panama',
       'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Qatar', 'Republic of Ireland',
       'Republic of the Congo', 'Romania', 'Russia', 'Rwanda',
       'Saint Kitts and Nevis', 'Saint Lucia',
       'Saint Vincent and the Grenadines', 'Samoa', 'San Marino',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia', 'Slovenia',
       'Solomon Islands', 'Somalia', 'South Africa', 'South Korea',
       'South Sudan', 'Spain', 'Sri Lanka', 'Sudan', 'Suriname', 'Sweden',
       'Switzerland', 'Syria', 'Taiwan', 'Tajikistan', 'Tanzania',
       'Thailand', 'Timor-Leste', 'Togo', 'Trinidad and Tobago',
       'Tunisia', 'Turkey', 'Uganda', 'Ukraine', 'United Arab Emirates',
       'United Kingdom', 'Uruguay', 'Uzbekistan', 'Vanuatu',
       'Vatican City', 'Venezuela', 'Vietnam', 'Yemen', 'Zambia',
       'Zimbabwe'], dtype=object)

In [12]:
np.unique(df_region['country'])

array(['European Union[b]', 'United States', 'World[a]'], dtype=object)

<h3>6. Rename column in region df</h3>

In [13]:
df_region = df_region.rename(columns = {"country":"region"})

In [14]:
df_region

              region      Cases   Deaths
0           World[a]  242987401  4938251
1      United States   45400466   735373
2  European Union[b]   39371457   788718

<h3>7. Clean up values in region to remove extra characters</h3>

In [15]:
df_region.region = df_region.region.str.strip('[a]')
df_region.region = df_region.region.str.strip('[b]')

In [16]:
df_region

           region      Cases   Deaths
0           World  242987401  4938251
1   United States   45400466   735373
2  European Union   39371457   788718

<h3>8. Make country names uppercase to match other datasets to be used</h3>

In [17]:
df_country['country'] = df_country['country'].str.upper()

<ipython-input-17-3d82ff78366d>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_country['country'] = df_country['country'].str.upper()

In [18]:
df_country

              country     Cases  Deaths
3               INDIA  34159562  453708
4              BRAZIL  21711843  605139
5      UNITED KINGDOM   8730787  139743
6              RUSSIA   8041581  224369
7              TURKEY   7800766   68700
..                ...       ...     ...
189             PALAU         8       0
190           VANUATU         4       1
191  MARSHALL ISLANDS         4       —
192             SAMOA         3       —
193          KIRIBATI         2       —

[191 rows x 3 columns]

<h3>9. Sort by country and create new index</h3>

In [19]:
df_country = df_country.sort_values(['country']).reset_index(drop=True)

In [20]:
df_country

         country   Cases Deaths
0    AFGHANISTAN  155931   7252
1        ALBANIA  180623   2863
2        ALGERIA  205683   5883
3        ANDORRA   15404    130
4         ANGOLA   63691   1693
..           ...     ...    ...
186    VENEZUELA  397370   4775
187      VIETNAM  881522  21543
188        YEMEN    9650   1835
189       ZAMBIA  209610   3658
190     ZIMBABWE  132588   4663

[191 rows x 3 columns]

<h3>10. Check for any missing values in the cleaned dataset</h3>

In [21]:
for c in df_country.columns:
    miss = df_country[c].isnull().sum()
    if miss>0:
        print("{} has {} missing value(s)".format(c,miss))
    else:
        print("{} has no missing values".format(c))

country has no missing values
Cases has no missing values
Deaths has no missing values